/*З клавіатури вводяться вартість одиниці та кількість одиниць двох товарів.
Вивести на екран вартість кожного з видів товарів окремо і загальну
вартість. */

let a,b,c,d;

do 
{
     a = Number(prompt("введіть ціну першого товара: "));
}while(a<0 || isNaN(a))  
do
{
     b = Number(prompt("введіть кількість першого товара: "));
}while(b<0 || isNaN(b))
do
{
    c = Number(prompt("введіть ціну другого товара: "));
}while(c<0 || isNaN(c))
do
{
    d = Number(prompt("введіть кількість другого товара: "));
}while(d<0 || isNaN(d))
    

sum1 = a * b;
sum2 = c * d; 
sum = sum1 + sum2;
alert("Вартість першого товару= " + sum1 + "\n" + "Вартість другого товару = "+ sum2 + "\n" +"Загальна вартість = "+sum);
